// 이번 시간에는 이 설명 이후 smart pointer로 직행한다.
// 왜 RAII가 중요한가? - 예외 안전성을 보장하기 위해
// 이때 Dog 객체는 메모리 영역
// 1. 스택
// 2. 데이터
// 3. free-store (HEAP) 힙으로 부르기는 지양할 것

// 1,2번과 3번의 차이 - 메모리 크기를 언제 결정할 수 있는가.
// 1번과 2번의 차이	  - 메모리 크기가 얼마나 큰가.



#define Prac 1

#if Prac == 1
// 문제 형식
// 
#include <iostream>

// =======================================================================
//[문제]
//========================================================================

int main()
{

}




#elif Prac == 2
// 문제 형식
// 
#include <iostream>

// =======================================================================
//[문제]
//=======================================================================

int main()
{

}

#endif